Pandas

In [92]:
#  pands  -> Pandas is an open-source library that is used for handle data manipulation.

In [93]:
# # for installing pands in jupter or goolge colab
# #     !pip install pandas

# for installing in vs Code
#     pip install pandas

<!-- # data Structure of Pandas
(1). Series  --> It is one-dimentional array and it shows only values not coulmn

In [94]:
import pandas as pd

In [95]:
a=pd.Series([1,2,3,4,4,2])
a

0    1
1    2
2    3
3    4
4    4
5    2
dtype: int64

DataFrame

We have to create employee data using dictionary?

In [96]:
a1={'Emp_id':[1,2,3,4,5,6,7,8],
   'Emp_Name':['Sam','Raj','Mohit','Sam','Gourav','Mohit','Mohit','Mohit'],
   'Department':['IT','Sales','IT','Operations','HR','IT','Operations','HR'],
   'Working_hours':[8,9,9,9,9,8,7,8],
   'Salary':[23000,25000,35000,31000,28000,26000,30000,34000]
   }

In [97]:
df=pd.DataFrame(a1)
df

   Emp_id Emp_Name  Department  Working_hours  Salary
0       1      Sam          IT              8   23000
1       2      Raj       Sales              9   25000
2       3    Mohit          IT              9   35000
3       4      Sam  Operations              9   31000
4       5   Gourav          HR              9   28000
5       6    Mohit          IT              8   26000
6       7    Mohit  Operations              7   30000
7       8    Mohit          HR              8   34000

How do you export dataframe into csv files?

In [98]:
df.to_csv('Day028_ExportCSVFile.csv',index=False)

In [99]:
df.to_csv('E:\\REGEX\\Python\\Day028_ExportCSVFile.csv',index=False)

In [100]:
csv_import=pd.read_csv('Day028_ExportCSVFile.csv')
csv_import

   Emp_id Emp_Name  Department  Working_hours  Salary
0       1      Sam          IT              8   23000
1       2      Raj       Sales              9   25000
2       3    Mohit          IT              9   35000
3       4      Sam  Operations              9   31000
4       5   Gourav          HR              9   28000
5       6    Mohit          IT              8   26000
6       7    Mohit  Operations              7   30000
7       8    Mohit          HR              8   34000

In [101]:
# for top elements we use head(n)
csv_import.head(3)

   Emp_id Emp_Name Department  Working_hours  Salary
0       1      Sam         IT              8   23000
1       2      Raj      Sales              9   25000
2       3    Mohit         IT              9   35000

In [102]:
# for last elemtn we use tail(n)
csv_import.tail(2)

   Emp_id Emp_Name  Department  Working_hours  Salary
6       7    Mohit  Operations              7   30000
7       8    Mohit          HR              8   34000

In [103]:
# Home Work
# name,id,stream,fees,semester,department (min 10 rows, and min 5 columns)
# make data from jupiter and import to colab

In [104]:
import pandas as pd

In [105]:
student={'id':[1,2,3,4,5,6,7,8,9,10],
        'name':['Ashu','Raj','Mohit','Sam','Gourav','Mohit','Mohit','Mohit','Raj','Mohit'],
   'stream':['IT','Sales','IT','Operations','HR','IT','Operations','HR','IT','Sales'],
   'fees':[23000,25000,35000,31000,28000,26000,30000,34000,23000,25000],
   'semester':[1,2,3,4,5,6,7,8,9,10],
   'department':['IT','Sales','IT','Operations','HR','IT','Operations','HR','IT','Sales']
   }
student_df=pd.DataFrame(student)
student_df.to_csv('Day028_A_ExportCSVFile.csv',index=False)

In [106]:
student_df

   id    name      stream   fees  semester  department
0   1    Ashu          IT  23000         1          IT
1   2     Raj       Sales  25000         2       Sales
2   3   Mohit          IT  35000         3          IT
3   4     Sam  Operations  31000         4  Operations
4   5  Gourav          HR  28000         5          HR
5   6   Mohit          IT  26000         6          IT
6   7   Mohit  Operations  30000         7  Operations
7   8   Mohit          HR  34000         8          HR
8   9     Raj          IT  23000         9          IT
9  10   Mohit       Sales  25000        10       Sales

# Day 2

In [107]:
import pandas as pd
covid_data=pd.read_csv('Day028_Sample_data_covid_toy.csv')
covid_data

    age  gender  fever   cough       city has_covid
0    60    Male  103.0    Mild    Kolkata        No
1    27    Male  100.0    Mild      Delhi       Yes
2    42    Male  101.0    Mild      Delhi        No
3    31  Female   98.0    Mild    Kolkata        No
4    65  Female  101.0    Mild     Mumbai        No
..  ...     ...    ...     ...        ...       ...
95   12  Female  104.0    Mild  Bangalore        No
96   51  Female  101.0  Strong    Kolkata       Yes
97   20  Female  101.0    Mild  Bangalore        No
98    5  Female   98.0  Strong     Mumbai        No
99   10  Female   98.0  Strong    Kolkata       Yes

[100 rows x 6 columns]

In [108]:
# for geting top rows in dataframes we use -------head(n)-------
print(covid_data.head(3))
print('new data')
print(covid_data.head()) # by default it will give top 5 rows
print('new data')
print(covid_data.head(1))
print('new data')
print(covid_data.head(0)) # it will give empty dataframe
print('new data')
print(covid_data.head(10))

   age gender  fever cough     city has_covid
0   60   Male  103.0  Mild  Kolkata        No
1   27   Male  100.0  Mild    Delhi       Yes
2   42   Male  101.0  Mild    Delhi        No
new data
   age  gender  fever cough     city has_covid
0   60    Male  103.0  Mild  Kolkata        No
1   27    Male  100.0  Mild    Delhi       Yes
2   42    Male  101.0  Mild    Delhi        No
3   31  Female   98.0  Mild  Kolkata        No
4   65  Female  101.0  Mild   Mumbai        No
new data
   age gender  fever cough     city has_covid
0   60   Male  103.0  Mild  Kolkata        No
new data
Empty DataFrame
Columns: [age, gender, fever, cough, city, has_covid]
Index: []
new data
   age  gender  fever   cough       city has_covid
0   60    Male  103.0    Mild    Kolkata        No
1   27    Male  100.0    Mild      Delhi       Yes
2   42    Male  101.0    Mild      Delhi        No
3   31  Female   98.0    Mild    Kolkata        No
4   65  Female  101.0    Mild     Mumbai        No
5   84  Female    NaN    Mild  Bangalore       Yes
6   14    Male  101.0  Strong  Bangalore        No
7   20  Female    NaN  Strong     Mumbai       Yes
8   19  Female  100.0  Strong  Bangalore        No
9   64  Female  101.0    Mild      Delhi        No

In [109]:
df.columns

Index(['Emp_id', 'Emp_Name', 'Department', 'Working_hours', 'Salary'], dtype='object')

In [110]:
# we use ---tail()--- when we want to see last rows in dataframes
print(covid_data.tail(3))
print('\nnew data\n')
print(covid_data.tail()) # by default it will give last 5 rows
print('\nnew data\n')
print(covid_data.tail(0)) # it will give empty dataframe

    age  gender  fever   cough       city has_covid
97   20  Female  101.0    Mild  Bangalore        No
98    5  Female   98.0  Strong     Mumbai        No
99   10  Female   98.0  Strong    Kolkata       Yes

new data

    age  gender  fever   cough       city has_covid
95   12  Female  104.0    Mild  Bangalore        No
96   51  Female  101.0  Strong    Kolkata       Yes
97   20  Female  101.0    Mild  Bangalore        No
98    5  Female   98.0  Strong     Mumbai        No
99   10  Female   98.0  Strong    Kolkata       Yes

new data

Empty DataFrame
Columns: [age, gender, fever, cough, city, has_covid]
Index: []

In [111]:
# we use sample(n) for random rows in dataframes
print(covid_data.sample(3))

    age gender  fever   cough       city has_covid
42   27   Male  100.0    Mild      Delhi       Yes
48   66   Male   99.0  Strong  Bangalore        No
87   47   Male  101.0  Strong  Bangalore        No

In [112]:
# we use shape for getting rows and columns in dataframes
print(covid_data.shape)

(100, 6)

In [113]:
# for getting all elements from dataframe in list format we use ---values---
print(covid_data.values)

[[60 'Male' 103.0 'Mild' 'Kolkata' 'No']
 [27 'Male' 100.0 'Mild' 'Delhi' 'Yes']
 [42 'Male' 101.0 'Mild' 'Delhi' 'No']
 [31 'Female' 98.0 'Mild' 'Kolkata' 'No']
 [65 'Female' 101.0 'Mild' 'Mumbai' 'No']
 [84 'Female' nan 'Mild' 'Bangalore' 'Yes']
 [14 'Male' 101.0 'Strong' 'Bangalore' 'No']
 [20 'Female' nan 'Strong' 'Mumbai' 'Yes']
 [19 'Female' 100.0 'Strong' 'Bangalore' 'No']
 [64 'Female' 101.0 'Mild' 'Delhi' 'No']
 [75 'Female' nan 'Mild' 'Delhi' 'No']
 [65 'Female' 98.0 'Mild' 'Mumbai' 'Yes']
 [25 'Female' 99.0 'Strong' 'Kolkata' 'No']
 [64 'Male' 102.0 'Mild' 'Bangalore' 'Yes']
 [51 'Male' 104.0 'Mild' 'Bangalore' 'No']
 [70 'Male' 103.0 'Strong' 'Kolkata' 'Yes']
 [69 'Female' 103.0 'Mild' 'Kolkata' 'Yes']
 [40 'Female' 98.0 'Strong' 'Delhi' 'No']
 [64 'Female' 98.0 'Mild' 'Bangalore' 'Yes']
 [42 'Female' nan 'Strong' 'Bangalore' 'Yes']
 [12 'Male' 98.0 'Strong' 'Bangalore' 'No']
 [73 'Male' 98.0 'Mild' 'Bangalore' 'Yes']
 [71 'Female' 98.0 'Strong' 'Kolkata' 'Yes']
 [80 'Female' 98.0 'Mild' 'Delhi' 'Yes']
 [13 'Female' 100.0 'Strong' 'Kolkata' 'No']
 [23 'Male' nan 'Mild' 'Mumbai' 'No']
 [19 'Female' 100.0 'Mild' 'Kolkata' 'Yes']
 [33 'Female' 102.0 'Strong' 'Delhi' 'No']
 [16 'Male' 104.0 'Mild' 'Kolkata' 'No']
 [34 'Female' nan 'Strong' 'Mumbai' 'Yes']
 [15 'Male' 101.0 'Mild' 'Delhi' 'Yes']
 [83 'Male' 103.0 'Mild' 'Kolkata' 'No']
 [34 'Female' 101.0 'Strong' 'Delhi' 'Yes']
 [26 'Female' 98.0 'Mild' 'Kolkata' 'No']
 [74 'Male' 102.0 'Mild' 'Mumbai' 'Yes']
 [82 'Female' 102.0 'Strong' 'Bangalore' 'No']
 [38 'Female' 101.0 'Mild' 'Bangalore' 'No']
 [55 'Male' 100.0 'Mild' 'Kolkata' 'No']
 [49 'Female' 101.0 'Mild' 'Delhi' 'Yes']
 [50 'Female' 103.0 'Mild' 'Kolkata' 'No']
 [49 'Female' 102.0 'Mild' 'Delhi' 'No']
 [82 'Male' nan 'Mild' 'Kolkata' 'Yes']
 [27 'Male' 100.0 'Mild' 'Delhi' 'Yes']
 [22 'Female' 99.0 'Mild' 'Bangalore' 'Yes']
 [20 'Male' 102.0 'Strong' 'Delhi' 'No']
 [72 'Male' 99.0 'Mild' 'Bangalore' 'No']
 [19 'Female' 101.0 'Mild' 'Mumbai' 'No']
 [18 'Female' 104.0 'Mild' 'Bangalore' 'No']
 [66 'Male' 99.0 'Strong' 'Bangalore' 'No']
 [44 'Male' 104.0 'Mild' 'Mumbai' 'No']
 [19 'Male' 101.0 'Mild' 'Delhi' 'Yes']
 [11 'Female' 100.0 'Strong' 'Kolkata' 'Yes']
 [47 'Female' 100.0 'Strong' 'Bangalore' 'Yes']
 [83 'Male' 98.0 'Mild' 'Delhi' 'Yes']
 [60 'Female' 99.0 'Mild' 'Mumbai' 'Yes']
 [81 'Female' 101.0 'Mild' 'Mumbai' 'Yes']
 [71 'Male' nan 'Strong' 'Kolkata' 'No']
 [49 'Female' 99.0 'Strong' 'Bangalore' 'No']
 [23 'Male' 98.0 'Strong' 'Mumbai' 'Yes']
 [6 'Female' 104.0 'Mild' 'Kolkata' 'Yes']
 [24 'Female' 102.0 'Strong' 'Bangalore' 'Yes']
 [81 'Female' 98.0 'Strong' 'Mumbai' 'No']
 [56 'Female' 104.0 'Strong' 'Bangalore' 'Yes']
 [10 'Male' 100.0 'Mild' 'Bangalore' 'No']
 [42 'Male' 104.0 'Mild' 'Mumbai' 'No']
 [69 'Female' 102.0 'Mild' 'Bangalore' 'No']
 [51 'Male' 104.0 'Mild' 'Kolkata' 'No']
 [65 'Male' 99.0 'Mild' 'Bangalore' 'No']
 [54 'Female' 104.0 'Strong' 'Kolkata' 'No']
 [73 'Female' 103.0 'Mild' 'Delhi' 'No']
 [68 'Female' 101.0 'Strong' 'Delhi' 'No']
 [75 'Female' 104.0 'Strong' 'Delhi' 'No']
 [83 'Female' 101.0 'Mild' 'Kolkata' 'No']
 [34 'Male' 98.0 'Strong' 'Kolkata' 'Yes']
 [34 'Female' 104.0 'Strong' 'Delhi' 'No']
 [5 'Male' 102.0 'Mild' 'Kolkata' 'Yes']
 [80 'Male' 100.0 'Mild' 'Bangalore' 'Yes']
 [8 'Female' 101.0 'Mild' 'Kolkata' 'No']
 [11 'Male' 100.0 'Mild' 'Bangalore' 'Yes']
 [48 'Female' 103.0 'Mild' 'Kolkata' 'Yes']
 [14 'Female' 99.0 'Mild' 'Mumbai' 'Yes']
 [65 'Male' 99.0 'Mild' 'Delhi' 'No']
 [24 'Male' 98.0 'Mild' 'Kolkata' 'Yes']
 [17 'Female' 104.0 'Mild' 'Kolkata' 'No']
 [69 'Female' 98.0 'Strong' 'Mumbai' 'No']
 [16 'Female' 103.0 'Mild' 'Bangalore' 'Yes']
 [25 'Male' 104.0 'Mild' 'Bangalore' 'Yes']
 [47 'Male' 101.0 'Strong' 'Bangalore' 'No']
 [5 'Female' 100.0 'Mild' 'Kolkata' 'No']
 [46 'Male' 103.0 'Strong' 'Bangalore' 'No']
 [59 'Female' 99.0 'Strong' 'Delhi' 'No']
 [38 'Male' nan 'Mild' 'Delhi' 'Yes']
 [82 'Female' 102.0 'Strong' 'Kolkata' 'No']
 [27 'Male' 100.0 'Mild' 'Kolkata' 'Yes']
 [79 'Male' nan 'Strong' 'Kolkata' 'Yes']
 [12 'Female' 104.0 'Mild' 'Bangalore' 'No']
 [51 'Female' 101.0 'Strong' 'Kolkata' 'Yes']
 [20 'Female' 101.0 'Mild' 'Bangalore' 'No']
 [5 'Female' 98.0 'Strong' 'Mumbai' 'No']
 [10 'Female' 98.0 'Strong' 'Kolkata' 'Yes']]

In [114]:
# describe() # it will give all the statistical data from dataframe like mean, median, mode, min, max, count, std, 25%, 50%, 75%
covid_data.describe()

              age       fever
count  100.000000   90.000000
mean    44.220000  100.844444
std     24.878931    2.054926
min      5.000000   98.000000
25%     20.000000   99.000000
50%     45.000000  101.000000
75%     66.500000  102.750000
max     84.000000  104.000000

In [115]:
# Modify Data in Dataframes
covid_data['has_covid'][2]='Yes'

C:\Users\aaa\AppData\Local\Temp\ipykernel_7384\1188820866.py:2: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  covid_data['has_covid'][2]='Yes'
C:\Users\aaa\AppData\Local\Temp\ipykernel_7384\1188820866.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  covid_data['has_covid'][2]='Yes'

In [116]:
covid_data.loc[2]

age             42
gender        Male
fever        101.0
cough         Mild
city         Delhi
has_covid      Yes
Name: 2, dtype: object

In [117]:
# loc() # it will give the data from the given index
covid_data.loc[2:3,['age','gender','has_covid']]

   age  gender has_covid
2   42    Male       Yes
3   31  Female        No

In [118]:
# info() is used to get the information of the dataframes
covid_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        100 non-null    int64
 1   gender     100 non-null    object
 2   fever      90 non-null     float64
 3   cough      100 non-null    object
 4   city       100 non-null    object
 5   has_covid  100 non-null    object
dtypes: float64(1), int64(1), object(4)
memory usage: 4.8+ KB

In [119]:
# iloc() # it is used to get the data from the given index
# here we use index number instead of column name in loc() method

covid_data.iloc[2:3,0:3]

   age gender  fever
2   42   Male  101.0

In [120]:
covid_data['has_covid'].value_counts()

has_covid
No     54
Yes    46
Name: count, dtype: int64

In [121]:
covid_data['gender'].value_counts()

gender
Female    59
Male      41
Name: count, dtype: int64

In [122]:
covid_data['cough'].value_counts()

cough
Mild      62
Strong    38
Name: count, dtype: int64

In [123]:
# we will not do value_count on age because it is a continuous data and value_count is used for categorical data.T
# Catorical data is a data that can be divided into categories.
# Numerical data is a data that can be divided into numbers.

# Day 3

In [124]:
import pandas as pd

In [125]:
fData=pd.read_csv('Day028_flipkartMoniterData.csv')

In [126]:
fData1=fData.iloc[:,[2,3,7,14,15,16,17,19]].copy()
fData1.rename(columns={'KzDlHZ                                                                                                       ':'Title',
                       'XQDdHH ':'Rating',
                       'Wphh3N 2        ':'Review',
                       'Nx9bqj      ':'Price',
                       'yRaY8j      ':'MRP',
                       'UkUFwK  ':'Discount',
                       'yiggsN        ':'Delivery',
                       'yiggsN 3      ':'Offer'},inplace=True)
fData1

,Title,Rating,Review,Price,MRP,Discount,Delivery,Offer
0,Frontech - 50.8 cm (20 inch) HD LED Backlit VA...,4,53 Reviews,"₹2,699","₹8,000",66% off,Free delivery,Bank Offer
1,DELL S Series 68.58 cm (27 inch) Full HD IPS P...,4.4,545 Reviews,"₹11,999","₹23,316",48% off,Free delivery,Upto
2,DELL 68.58 cm (27 inch) Full HD LED Backlit VA...,4.4,35 Reviews,"₹9,299","₹31,859",70% off,Free delivery,Bank Offer
3,ZEBSTER 50.8 cm (20 inch) HD VA Panel Monitor ...,3.8,20 Reviews,"₹2,699","₹6,999",61% off,Free delivery,Bank Offer
4,Acer 54.61 cm (21.5 inch) Full HD LED Backlit ...,4.3,878 Reviews,"₹5,999","₹7,599",21% off,Free delivery,Bank Offer
...,...,...,...,...,...,...,...,...
480,ASUS 68.58 cm (27 inch) Full HD LED Backlit IP...,4.3,10 Reviews,"₹31,999","₹45,000",28% off,Free delivery,Upto
481,LG UltraFine 68.58 cm (27 inch) 4K Ultra HD IP...,4.6,5 Reviews,"₹38,200","₹53,500",28% off,Free delivery,Bank Offer
482,MSI 68.58 cm (27 inch) WQHD IPS Panel with Eye...,4.3,4 Reviews,"₹16,061","₹30,000",46% off,Free delivery,Bank Offer
483,leoxsys 39.62 cm (15.6 inch) Full HD LED Backl...,4.7,0 Reviews,"₹16,669","₹24,990",33% off,Free delivery,
484,...,,,,,,,

In [127]:
print(fData1.columns)

Index(['Title', 'Rating', 'Review', 'Price', 'MRP', 'Discount', 'Delivery',
       'Offer'],
      dtype='object')

In [128]:
fData1.to_csv('Day_028_Output_FlipkartMoniterData.csv',index=False)

# Day 4

In [129]:
placement=pd.read_csv('Day028_placement.csv')
tips=pd.read_csv('Day028_tips.csv')
titanic=pd.read_csv('Day028_titanic.csv')

In [130]:
placement.head(3)

   cgpa  resume_score  placed
0  8.14          6.52       1
1  6.17          5.17       0
2  8.27          8.86       1

In [131]:
placement.tail(3)

    cgpa  resume_score  placed
97  6.65          7.78       0
98  8.14          5.63       1
99  6.09          6.61       0

In [132]:
placement.sample(3)

    cgpa  resume_score  placed
90  5.85          5.56       0
97  6.65          7.78       0
3   6.88          7.27       1

In [133]:
placement.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   cgpa          100 non-null    float64
 1   resume_score  100 non-null    float64
 2   placed        100 non-null    int64
dtypes: float64(2), int64(1)
memory usage: 2.5 KB

In [134]:
placement.describe()

           cgpa  resume_score      placed
count  100.0000    100.000000  100.000000
mean     6.9422      6.930500    0.500000
std      1.1192      0.979608    0.502519
min      5.2700      4.950000    0.000000
25%      5.9800      6.190000    0.000000
50%      6.6200      7.055000    0.500000
75%      8.0450      7.640000    1.000000
max      9.4000      9.060000    1.000000

In [135]:
placement.loc[0:5,['cgpa','resume_score']]

   cgpa  resume_score
0  8.14          6.52
1  6.17          5.17
2  8.27          8.86
3  6.88          7.27
4  7.52          7.30
5  8.77          6.19

In [136]:
placement.iloc[0:5,[1,2]]

   resume_score  placed
0          6.52       1
1          5.17       0
2          8.86       1
3          7.27       1
4          7.30       1

In [137]:
placement_empty=placement.empty # it will return true if dataframe is empty otherwise it will return false
placement_empty # it will give False because it is not empty

False

In [138]:
placement.isnull().sum() # it will give the sum of null values in each column

cgpa            0
resume_score    0
placed          0
dtype: int64

In [139]:
placement.dropna() # it will remove all the rows which have null values

    cgpa  resume_score  placed
0   8.14          6.52       1
1   6.17          5.17       0
2   8.27          8.86       1
3   6.88          7.27       1
4   7.52          7.30       1
..   ...           ...     ...
95  6.33          6.38       0
96  8.23          7.76       1
97  6.65          7.78       0
98  8.14          5.63       1
99  6.09          6.61       0

[100 rows x 3 columns]

In [140]:
print(placement.ndim)

2

In [141]:
placement.axes

[RangeIndex(start=0, stop=100, step=1),
 Index(['cgpa', 'resume_score', 'placed'], dtype='object')]

In [142]:
placement_data=placement.values
placement_data

array([[8.14, 6.52, 1.  ],
       [6.17, 5.17, 0.  ],
       [8.27, 8.86, 1.  ],
       [6.88, 7.27, 1.  ],
       [7.52, 7.3 , 1.  ],
       [8.77, 6.19, 1.  ],
       [5.34, 7.09, 0.  ],
       [6.56, 6.29, 0.  ],
       [6.32, 6.71, 0.  ],
       [7.69, 7.12, 1.  ],
       [6.18, 6.35, 0.  ],
       [5.44, 6.54, 0.  ],
       [6.09, 7.01, 0.  ],
       [8.5 , 5.09, 1.  ],
       [7.51, 6.25, 1.  ],
       [8.88, 5.93, 1.  ],
       [8.04, 7.64, 1.  ],
       [7.81, 8.71, 1.  ],
       [5.94, 5.88, 0.  ],
       [6.75, 8.11, 1.  ],
       [5.8 , 8.06, 0.  ],
       [6.53, 7.64, 0.  ],
       [6.16, 5.77, 0.  ],
       [6.05, 7.13, 0.  ],
       [8.22, 6.18, 1.  ],
       [7.76, 5.68, 1.  ],
       [6.27, 6.47, 0.  ],
       [5.51, 6.15, 0.  ],
       [7.46, 7.67, 1.  ],
       [6.19, 7.3 , 0.  ],
       [7.36, 7.15, 1.  ],
       [5.92, 7.02, 0.  ],
       [5.87, 7.96, 0.  ],
       [8.43, 7.73, 1.  ],
       [8.87, 7.19, 1.  ],
       [8.07, 7.48, 1.  ],
       [8.16, 7.56, 1.  ],
       [9.05, 8.21, 1.  ],
       [6.  , 8.72, 0.  ],
       [7.5 , 6.19, 1.  ],
       [8.25, 5.32, 1.  ],
       [8.68, 5.15, 1.  ],
       [6.9 , 6.91, 1.  ],
       [8.21, 7.95, 1.  ],
       [5.47, 5.92, 0.  ],
       [8.1 , 5.44, 1.  ],
       [5.83, 5.21, 0.  ],
       [7.05, 8.14, 1.  ],
       [5.54, 6.57, 0.  ],
       [5.46, 6.73, 0.  ],
       [8.22, 6.74, 1.  ],
       [6.54, 7.39, 0.  ],
       [5.9 , 7.5 , 0.  ],
       [6.  , 7.16, 0.  ],
       [5.92, 7.18, 0.  ],
       [6.94, 6.87, 1.  ],
       [6.13, 6.43, 0.  ],
       [6.34, 7.21, 0.  ],
       [6.47, 7.37, 0.  ],
       [5.95, 7.57, 0.  ],
       [5.87, 6.64, 0.  ],
       [6.89, 7.96, 1.  ],
       [5.75, 8.43, 0.  ],
       [8.65, 7.58, 1.  ],
       [7.93, 8.09, 1.  ],
       [6.04, 8.75, 0.  ],
       [8.35, 8.02, 1.  ],
       [6.59, 6.81, 1.  ],
       [6.01, 7.49, 0.  ],
       [8.06, 9.06, 1.  ],
       [7.12, 7.41, 1.  ],
       [7.34, 8.22, 1.  ],
       [7.63, 7.98, 1.  ],
       [5.76, 6.48, 0.  ],
       [5.54, 7.36, 0.  ],
       [6.34, 7.94, 1.  ],
       [9.4 , 5.5 , 1.  ],
       [5.88, 6.92, 0.  ],
       [5.79, 5.66, 0.  ],
       [5.27, 7.28, 0.  ],
       [7.83, 7.7 , 1.  ],
       [6.12, 6.72, 0.  ],
       [7.92, 6.06, 1.  ],
       [7.6 , 8.08, 1.  ],
       [5.76, 6.49, 0.  ],
       [6.72, 5.46, 0.  ],
       [6.18, 5.76, 0.  ],
       [5.62, 5.05, 0.  ],
       [8.07, 6.07, 1.  ],
       [5.99, 7.49, 0.  ],
       [5.85, 5.56, 0.  ],
       [8.28, 6.3 , 1.  ],
       [5.43, 6.18, 0.  ],
       [9.31, 7.39, 1.  ],
       [8.01, 4.95, 1.  ],
       [6.33, 6.38, 0.  ],
       [8.23, 7.76, 1.  ],
       [6.65, 7.78, 0.  ],
       [8.14, 5.63, 1.  ],
       [6.09, 6.61, 0.  ]])

In [143]:
placemnt_copy_data=placement.copy()
placemnt_copy_data

    cgpa  resume_score  placed
0   8.14          6.52       1
1   6.17          5.17       0
2   8.27          8.86       1
3   6.88          7.27       1
4   7.52          7.30       1
..   ...           ...     ...
95  6.33          6.38       0
96  8.23          7.76       1
97  6.65          7.78       0
98  8.14          5.63       1
99  6.09          6.61       0

[100 rows x 3 columns]

In [144]:
placement_sortby_resumescore=placement.sort_values('resume_score',ascending=False)
placement_sortby_resumescore

    cgpa  resume_score  placed
69  8.06          9.06       1
2   8.27          8.86       1
65  6.04          8.75       0
38  6.00          8.72       0
17  7.81          8.71       1
..   ...           ...     ...
1   6.17          5.17       0
41  8.68          5.15       1
13  8.50          5.09       1
87  5.62          5.05       0
94  8.01          4.95       1

[100 rows x 3 columns]

In [145]:
placement_sortby_index=placement.sort_index(ascending=False)
placement_sortby_index

    cgpa  resume_score  placed
99  6.09          6.61       0
98  8.14          5.63       1
97  6.65          7.78       0
96  8.23          7.76       1
95  6.33          6.38       0
..   ...           ...     ...
4   7.52          7.30       1
3   6.88          7.27       1
2   8.27          8.86       1
1   6.17          5.17       0
0   8.14          6.52       1

[100 rows x 3 columns]

In [146]:
# Add new Column in Dataframes
placemnt_copy_data['New score']=placemnt_copy_data['resume_score'].astype(int)

In [147]:
placemnt_copy_data

    cgpa  resume_score  placed  New score
0   8.14          6.52       1          6
1   6.17          5.17       0          5
2   8.27          8.86       1          8
3   6.88          7.27       1          7
4   7.52          7.30       1          7
..   ...           ...     ...        ...
95  6.33          6.38       0          6
96  8.23          7.76       1          7
97  6.65          7.78       0          7
98  8.14          5.63       1          5
99  6.09          6.61       0          6

[100 rows x 4 columns]

In [148]:
# change data type of the column
placemnt_copy_data['resume_score']=placemnt_copy_data['resume_score'].astype(int)
placemnt_copy_data

    cgpa  resume_score  placed  New score
0   8.14             6       1          6
1   6.17             5       0          5
2   8.27             8       1          8
3   6.88             7       1          7
4   7.52             7       1          7
..   ...           ...     ...        ...
95  6.33             6       0          6
96  8.23             7       1          7
97  6.65             7       0          7
98  8.14             5       1          5
99  6.09             6       0          6

[100 rows x 4 columns]

In [149]:
placemnt_copy_data.columns

Index(['cgpa', 'resume_score', 'placed', 'New score'], dtype='object')

In [150]:
# remove /drop column from dataframes
df=placemnt_copy_data.drop('cgpa',axis=1)
print(placemnt_copy_data)
print(df)

    cgpa  resume_score  placed  New score
0   8.14             6       1          6
1   6.17             5       0          5
2   8.27             8       1          8
3   6.88             7       1          7
4   7.52             7       1          7
..   ...           ...     ...        ...
95  6.33             6       0          6
96  8.23             7       1          7
97  6.65             7       0          7
98  8.14             5       1          5
99  6.09             6       0          6

[100 rows x 4 columns]
    resume_score  placed  New score
0              6       1          6
1              5       0          5
2              8       1          8
3              7       1          7
4              7       1          7
..           ...     ...        ...
95             6       0          6
96             7       1          7
97             7       0          7
98             5       1          5
99             6       0          6

[100 rows x 3 columns]

In [151]:
placemnt_copy_data
# ADD values in column
placemnt_copy_data['Ashu']=4

In [152]:
# ADD values in column
placemnt_copy_data['cgpa']=placemnt_copy_data['cgpa']+4

In [153]:
placemnt_copy_data

     cgpa  resume_score  placed  New score  Ashu
0   12.14             6       1          6     4
1   10.17             5       0          5     4
2   12.27             8       1          8     4
3   10.88             7       1          7     4
4   11.52             7       1          7     4
..    ...           ...     ...        ...   ...
95  10.33             6       0          6     4
96  12.23             7       1          7     4
97  10.65             7       0          7     4
98  12.14             5       1          5     4
99  10.09             6       0          6     4

[100 rows x 5 columns]

In [154]:
placement_count=placement.count()
placement_count

cgpa            100
resume_score    100
placed          100
dtype: int64

In [155]:
placement_max=placement.max()
placement_max

cgpa            9.40
resume_score    9.06
placed          1.00
dtype: float64

In [156]:
placement_min=placement.min()
placement_min

cgpa            5.27
resume_score    4.95
placed          0.00
dtype: float64

In [157]:
placement_mean_cgpa=placement['cgpa'].mean()
placement_mean_cgpa

np.float64(6.942200000000001)

In [158]:
placement_mode_cgpa=placement['cgpa'].mode()
placement_mode_cgpa

0     5.54
1     5.76
2     5.87
3     5.92
4     6.00
5     6.09
6     6.18
7     6.34
8     8.07
9     8.14
10    8.22
Name: cgpa, dtype: float64

In [159]:
placement_median_cgpa=placement['cgpa'].median()
placement_median_cgpa

np.float64(6.62)

In [160]:
placement_filter=placement.filter(items=['cgpa','resume_score'])
placement_filter

    cgpa  resume_score
0   8.14          6.52
1   6.17          5.17
2   8.27          8.86
3   6.88          7.27
4   7.52          7.30
..   ...           ...
95  6.33          6.38
96  8.23          7.76
97  6.65          7.78
98  8.14          5.63
99  6.09          6.61

[100 rows x 2 columns]

In [161]:
placement_filter1=placement.filter(like='cgpa')
placement_filter1

    cgpa
0   8.14
1   6.17
2   8.27
3   6.88
4   7.52
..   ...
95  6.33
96  8.23
97  6.65
98  8.14
99  6.09

[100 rows x 1 columns]

In [162]:
placement_filter2=placement[['cgpa','resume_score']]
placement_filter2

    cgpa  resume_score
0   8.14          6.52
1   6.17          5.17
2   8.27          8.86
3   6.88          7.27
4   7.52          7.30
..   ...           ...
95  6.33          6.38
96  8.23          7.76
97  6.65          7.78
98  8.14          5.63
99  6.09          6.61

[100 rows x 2 columns]

In [163]:
placement_filter_rows = placement.filter(items=[0,1,2],axis=0)
placement_filter_rows

   cgpa  resume_score  placed
0  8.14          6.52       1
1  6.17          5.17       0
2  8.27          8.86       1

In [164]:
placement_filter_rows = placement.filter(items=[i for i in range(1,10)],axis=0)
placement_filter_rows

   cgpa  resume_score  placed
1  6.17          5.17       0
2  8.27          8.86       1
3  6.88          7.27       1
4  7.52          7.30       1
5  8.77          6.19       1
6  5.34          7.09       0
7  6.56          6.29       0
8  6.32          6.71       0
9  7.69          7.12       1

In [165]:
placement.columns

Index(['cgpa', 'resume_score', 'placed'], dtype='object')

In [166]:
placemnt_newdf=pd.DataFrame(placement.values,columns=placement.columns)
placemnt_newdf

    cgpa  resume_score  placed
0   8.14          6.52     1.0
1   6.17          5.17     0.0
2   8.27          8.86     1.0
3   6.88          7.27     1.0
4   7.52          7.30     1.0
..   ...           ...     ...
95  6.33          6.38     0.0
96  8.23          7.76     1.0
97  6.65          7.78     0.0
98  8.14          5.63     1.0
99  6.09          6.61     0.0

[100 rows x 3 columns]

In [167]:
placement.values.tolist()

[[8.14, 6.52, 1.0],
 [6.17, 5.17, 0.0],
 [8.27, 8.86, 1.0],
 [6.88, 7.27, 1.0],
 [7.52, 7.3, 1.0],
 [8.77, 6.19, 1.0],
 [5.34, 7.09, 0.0],
 [6.56, 6.29, 0.0],
 [6.32, 6.71, 0.0],
 [7.69, 7.12, 1.0],
 [6.18, 6.35, 0.0],
 [5.44, 6.54, 0.0],
 [6.09, 7.01, 0.0],
 [8.5, 5.09, 1.0],
 [7.51, 6.25, 1.0],
 [8.88, 5.93, 1.0],
 [8.04, 7.64, 1.0],
 [7.81, 8.71, 1.0],
 [5.94, 5.88, 0.0],
 [6.75, 8.11, 1.0],
 [5.8, 8.06, 0.0],
 [6.53, 7.64, 0.0],
 [6.16, 5.77, 0.0],
 [6.05, 7.13, 0.0],
 [8.22, 6.18, 1.0],
 [7.76, 5.68, 1.0],
 [6.27, 6.47, 0.0],
 [5.51, 6.15, 0.0],
 [7.46, 7.67, 1.0],
 [6.19, 7.3, 0.0],
 [7.36, 7.15, 1.0],
 [5.92, 7.02, 0.0],
 [5.87, 7.96, 0.0],
 [8.43, 7.73, 1.0],
 [8.87, 7.19, 1.0],
 [8.07, 7.48, 1.0],
 [8.16, 7.56, 1.0],
 [9.05, 8.21, 1.0],
 [6.0, 8.72, 0.0],
 [7.5, 6.19, 1.0],
 [8.25, 5.32, 1.0],
 [8.68, 5.15, 1.0],
 [6.9, 6.91, 1.0],
 [8.21, 7.95, 1.0],
 [5.47, 5.92, 0.0],
 [8.1, 5.44, 1.0],
 [5.83, 5.21, 0.0],
 [7.05, 8.14, 1.0],
 [5.54, 6.57, 0.0],
 [5.46, 6.73, 0.0],
 [8.22, 6.74, 1.0],
 [6.54, 7.39, 0.0],
 [5.9, 7.5, 0.0],
 [6.0, 7.16, 0.0],
 [5.92, 7.18, 0.0],
 [6.94, 6.87, 1.0],
 [6.13, 6.43, 0.0],
 [6.34, 7.21, 0.0],
 [6.47, 7.37, 0.0],
 [5.95, 7.57, 0.0],
 [5.87, 6.64, 0.0],
 [6.89, 7.96, 1.0],
 [5.75, 8.43, 0.0],
 [8.65, 7.58, 1.0],
 [7.93, 8.09, 1.0],
 [6.04, 8.75, 0.0],
 [8.35, 8.02, 1.0],
 [6.59, 6.81, 1.0],
 [6.01, 7.49, 0.0],
 [8.06, 9.06, 1.0],
 [7.12, 7.41, 1.0],
 [7.34, 8.22, 1.0],
 [7.63, 7.98, 1.0],
 [5.76, 6.48, 0.0],
 [5.54, 7.36, 0.0],
 [6.34, 7.94, 1.0],
 [9.4, 5.5, 1.0],
 [5.88, 6.92, 0.0],
 [5.79, 5.66, 0.0],
 [5.27, 7.28, 0.0],
 [7.83, 7.7, 1.0],
 [6.12, 6.72, 0.0],
 [7.92, 6.06, 1.0],
 [7.6, 8.08, 1.0],
 [5.76, 6.49, 0.0],
 [6.72, 5.46, 0.0],
 [6.18, 5.76, 0.0],
 [5.62, 5.05, 0.0],
 [8.07, 6.07, 1.0],
 [5.99, 7.49, 0.0],
 [5.85, 5.56, 0.0],
 [8.28, 6.3, 1.0],
 [5.43, 6.18, 0.0],
 [9.31, 7.39, 1.0],
 [8.01, 4.95, 1.0],
 [6.33, 6.38, 0.0],
 [8.23, 7.76, 1.0],
 [6.65, 7.78, 0.0],
 [8.14, 5.63, 1.0],
 [6.09, 6.61, 0.0]]

In [168]:
# rename column name

placement_rename=placement.rename(columns={'cgpa':'Updated CGPA','resume_score':'Updated Resume Score'})
placement_rename

    Updated CGPA  Updated Resume Score  placed
0           8.14                  6.52       1
1           6.17                  5.17       0
2           8.27                  8.86       1
3           6.88                  7.27       1
4           7.52                  7.30       1
..           ...                   ...     ...
95          6.33                  6.38       0
96          8.23                  7.76       1
97          6.65                  7.78       0
98          8.14                  5.63       1
99          6.09                  6.61       0

[100 rows x 3 columns]

In [170]:
placement.value_counts()

cgpa  resume_score  placed
5.27  7.28          0         1
5.34  7.09          0         1
5.43  6.18          0         1
5.44  6.54          0         1
5.46  6.73          0         1
                             ..
8.87  7.19          1         1
8.88  5.93          1         1
9.05  8.21          1         1
9.31  7.39          1         1
9.40  5.50          1         1
Name: count, Length: 100, dtype: int64